guilettmann/bms_tle9012/firmware/bms_tle9012/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "tle9012.h"
#include "tle9012_port.h"
#include "tle9012_regs.h"

#include <math.h>   /* logf, apenas na conversao NTC para graus */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* As structs de estado sao definidas apos os enums e defines de que dependem;
 * ver a secao "Estado agrupado" logo antes das variaveis privadas. */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define BMS_NODE_ID        1u     /* unico TLE9012 da cadeia                  */
#define BMS_NUM_CELLS      12u
#define BMS_MEAS_PERIOD_MS 100u

/* Falhas consecutivas ate declarar a cadeia caida e reinicializar. Tres
 * ciclos = 300 ms sem leitura valida, tempo de sobra para distinguir um
 * glitch pontual de um link que caiu. */
#define BMS_MAX_CONSEC_FAIL 3u

/* --- Protecoes ----------------------------------------------------------- */

/* Limiares de tensao de celula, em mV.
 *
 * ATENCAO: estes sao valores de BANCADA. Com o ladder resistivo em 12 V cada
 * "celula" le ~1056 mV, entao limiares reais de Li-ion (2500/4200) fariam a
 * subtensao disparar continuamente.
 *
 * Ao migrar para celulas reais:  UV = 2500,  OV = 4200. */
#define BMS_UV_THR_MV       500u
#define BMS_OV_THR_MV       2000u

/**
 * Histerese das falhas de tensao, em mV.
 *
 * Os flags CELL_UV e CELL_OV do TLE9012 sao latching (tipo rocw): uma vez
 * setados, so saem quando alguem escreve zero. Ou seja, QUANDO limpar e
 * decisao do firmware -- e limpar assim que a tensao volta a cruzar o limiar
 * produziria oscilacao continua com a celula parada em cima dele.
 *
 * Com histerese:
 *   UV limpa so quando a celula sobe acima de  (UV_THR + 200 mV)
 *   OV limpa so quando a celula desce abaixo de (OV_THR - 200 mV)
 *
 * A falha SEMPRE seta no limiar exato -- a histerese atrasa apenas a
 * recuperacao, nunca a deteccao. Numa protecao, errar para o lado de
 * permanecer em falha e o lado seguro.
 */
#define BMS_FAULT_HYST_MV   200u

/* Open load desativado: obrigatorio com ladder resistivo, que dispara open
 * load falso. Ao usar celulas reais, calcular conforme a secao 3.2.3. */
#define BMS_OL_MIN_MV       0u
#define BMS_OL_MAX_MV       0u

/* --- Codigo de falha ------------------------------------------------------ */

/**
 * Falha ativa mais severa, em forma simbolica.
 *
 * Existe porque as mascaras de bit sao ilegiveis em depurador: o Live
 * Expressions do CubeIDE mostra o NOME do enumerado quando a variavel e de
 * tipo enum, entao "BMS_FAULT_CELL_OV" aparece no lugar de "0x2000".
 *
 * A ordem e de prioridade decrescente -- a primeira condicao verdadeira
 * ganha. Perda de comunicacao vem antes de tudo porque, sem dado, nenhuma
 * outra protecao significa nada. Sobretensao vem antes de subtensao porque
 * sobrecarga tem consequencia termica, e subtensao so degrada.
 */
typedef enum
{
  BMS_FAULT_NONE = 0,
  BMS_FAULT_CHAIN_DOWN,     /**< cadeia caida, sem comunicacao              */
  BMS_FAULT_DATA_STALE,     /**< medicao obsoleta                           */
  BMS_FAULT_CELL_OV,        /**< sobretensao de celula                      */
  BMS_FAULT_CELL_UV,        /**< subtensao de celula                        */
  BMS_FAULT_EXT_OVERTEMP,   /**< sobretemperatura externa (NTC)             */
  BMS_FAULT_INT_OVERTEMP,   /**< sobretemperatura interna do CI             */
  BMS_FAULT_UNDERTEMP,      /**< subtemperatura -- deteccao em firmware     */
  BMS_FAULT_OPEN_LOAD,      /**< fio de sensoriamento aberto                */
  BMS_FAULT_ADC,            /**< soma dos PCVM diverge do BVM               */
  BMS_FAULT_INTERNAL_IC,    /**< erro interno do TLE9012                    */
  BMS_FAULT_REG_CRC,        /**< CRC de registrador                         */
  BMS_FAULT_PS_SLEEP,       /**< sleep por erro de alimentacao              */
  BMS_FAULT_BALANCING       /**< corrente de balanceamento fora do previsto */
} bms_fault_code_t;

/* --- Simulacao de falhas (demonstracao) ---------------------------------- */

/**
 * Modos de injecao de falha, para demonstracao em inspecao tecnica.
 *
 * IMPORTANTE: nenhum destes modos falsifica flag. Todos criam uma CONDICAO
 * que o TLE9012 detecta de verdade -- o caminho de deteccao, os registradores
 * de diagnostico e o intertravamento que desliga o balanceamento sao os
 * mesmos de uma falha real. O que muda e a origem da condicao, nao a
 * deteccao. Forjar os flags mostraria o LED aceso sem provar nada.
 */
typedef enum
{
  BMS_SIM_NONE = 0,       /**< operacao normal                              */
  BMS_SIM_UNDERVOLTAGE,   /**< limiar de UV acima da tensao real            */
  BMS_SIM_OVERVOLTAGE,    /**< limiar de OV abaixo da tensao real           */
  BMS_SIM_OVERTEMP,       /**< limiar de OT acima da leitura real do NTC    */
  BMS_SIM_OPEN_LOAD,      /**< diagnostico de open load com ladder resistivo */
  BMS_SIM_COMM_LOSS,      /**< poe o TLE9012 em sleep: perda de comunicacao */
  BMS_SIM_UNDERTEMP,      /**< limiar de UT abaixo da resistencia real      */
  BMS_SIM_COUNT
} bms_sim_fault_t;

