guilettmann/bms_tle9012/firmware/bms_tle9012/Core/Src/main.c
/* Margem entre a tensao medida e o limiar injetado. Precisa ser maior que a
 * dispersao entre celulas para a falha pegar todas de uma vez. */
#define BMS_SIM_MARGIN_MV   200u

/* --- Temperatura --------------------------------------------------------- */

#define BMS_NUM_TEMP        5u    /* TMP0 a TMP4                              */
#define BMS_TEMP_INTC       1u    /* fonte de corrente ITMPz_1                */
#define BMS_TEMP_OT_THR     0u    /* 0 desativa a deteccao de sobretemperatura */

/* Le temperatura a cada 10 ciclos de tensao (1 s). O round robin faz no
 * maximo duas medicoes de temperatura por ciclo, entao nao adianta ler mais
 * rapido -- e temperatura de celula nao muda em 100 ms. */
#define BMS_TEMP_EVERY_N    10u

/* Resistor de referencia em serie com os NTCs (R_TMP no esquematico).
 * O manual usa 100 ohm no exemplo da secao 3.4.2. CONFERIR NA PLACA. */
#define BMS_TEMP_R_SERIES   100u

/* Resistencia populada na placa em paralelo com o NTC externo (posicoes
 * NTC0..NTC4 da Figura 18). Medida em bancada: ~5,2 kohm nos cinco canais.
 * Zero desativa a compensacao.
 *
 * Isto e um PALIATIVO. Dessoldar o componente da placa da leitura limpa; a
 * compensacao amplifica erro em temperaturas baixas, onde R_medido se
 * aproxima deste valor. */
#define BMS_TEMP_R_PARALLEL 5197u

/* Parametros do NTC (MF52A), usados APENAS na conversao para graus, que serve
 * para conferencia visual. As protecoes comparam em ohms e nao dependem disto.
 *
 * MF52A e nome de familia, nao de valor: existem variantes de 1k a 100k e
 * varios B. A mais comum e 10 kohm com B = 3950 -- e o que esta aqui.
 * CONFERIR no encapsulamento ou medindo com multimetro a temperatura conhecida.
 *
 * B errado nao desloca a leitura a 25 C (os dois ancoram em R25), mas afasta
 * progressivamente conforme sai dessa temperatura -- justamente na faixa em
 * que um pack opera. Vira parametro da tabela em flash na fase 3. */
#define BMS_NTC_R25_OHM     10000.0f
#define BMS_NTC_BETA        3950.0f

/**
 * Limiar de SUBTEMPERATURA, em ohms do NTC.
 *
 * O TLE9012 NAO detecta subtemperatura -- ele so tem EXT_OT_THR, para o lado
 * quente. Nao existe registrador de limiar frio. Portanto esta protecao e
 * feita em FIRMWARE, comparando a resistencia medida.
 *
 * Como o NTC tem coeficiente negativo, mais frio significa MAIOR resistencia:
 * a falha e temp.ohms > limiar.
 *
 * 25925 ohm = 5 C para um MF52A de 10 kohm com B = 3950. Recalcular se trocar
 * de NTC -- este numero depende inteiramente de R25 e B.
 *
 * Por que 5 C importa: carregar celula de litio perto de 0 C causa
 * lithium plating, que degrada de forma permanente e cria risco de curto
 * interno. O limiar de carga costuma ser mais restritivo que o de descarga.
 */
#define BMS_UT_THR_OHM      25925uL

/**
 * Limite de confianca da compensacao de paralelo, em porcentagem de
 * R_PARALLEL.
 *
 * A compensacao divide por (R_paralelo - R_medido). Quando os dois se
 * aproximam, o denominador tende a zero e ruido de poucos ohms vira centenas
 * de kohm. Acima deste percentual o resultado nao e confiavel e o canal e
 * marcado invalido, em vez de reportar um numero inventado.
 *
 * 90% de 5197 = 4677 ohm, que corresponde a cerca de -5 C. Abaixo disso a
 * medicao com resistor em paralelo nao serve mesmo -- a solucao e dessoldar
 * o componente da placa, nao afrouxar este limite.
 */
#define BMS_TEMP_TRUST_PCT  90u

/* Tentativas de polling do PCVM_START antes de desistir da conversao. Cada
 * tentativa custa uma leitura (~50 us) mais 100 us de espera, entao 100
 * tentativas dao ~15 ms de teto -- folga larga sobre o tempo real. */
#define BMS_CONV_MAX_POLLS 100u
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

COM_InitTypeDef BspCOMInit;
UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart1_tx;

/* USER CODE BEGIN PV */
/* ==========================================================================
 * Estado agrupado
 * ========================================================================== */

/** Estado da cadeia e do smoke test. */
typedef struct
{
  uint8_t  ready;           /**< 1 = cadeia inicializada e respondendo       */
  uint8_t  smoke_ok;        /**< 1 = link validado de ponta a ponta          */
  uint8_t  smoke_status;    /**< tle9012_status_t do readback                */
  uint16_t smoke_config;    /**< valor lido do CONFIG (0x36)                 */
  uint32_t smoke_attempts;  /**< tentativas de subir a cadeia                */
  uint8_t  diag_status;     /**< tle9012_status_t da leitura do GEN_DIAG     */
} bms_link_t;

/** Tensoes de celula. */
typedef struct
{
  uint16_t cell_mv[BMS_NUM_CELLS];  /**< tensao de cada celula, em mV        */
  uint16_t min_mv;
  uint16_t max_mv;
  uint16_t delta_mv;                /**< desbalanco: max - min               */
  uint8_t  valid;                   /**< 0 = cell_mv e historico, nao medicao */
  uint32_t age_ms;                  /**< ms desde a ultima medicao boa       */
  uint32_t count;                   /**< ciclos bem-sucedidos                */
  uint32_t fail_count;
  uint8_t  status;                  /**< tle9012_status_t da ultima transacao */
} bms_meas_t;

/** Temperaturas dos NTCs externos. */
typedef struct
{
  uint32_t ohms[BMS_NUM_TEMP];      /**< NTC isolado -- use este nas protecoes */
  uint32_t ohms_raw[BMS_NUM_TEMP];  /**< o que o ADC ve, com o paralelo da placa */
  float    celsius[BMS_NUM_TEMP];   /**< so para leitura humana              */
  uint8_t  valid[BMS_NUM_TEMP];
  uint32_t count;
  uint32_t fail_count;
  uint8_t  status;
} bms_temp_t;

/**
 * Falhas, limiares em vigor e historico.
 *
 * Os limiares moram aqui de proposito: numa demonstracao, mostrar o limiar ao
 * lado da medicao e do veredito -- tudo numa expansao so -- e o que torna a
 * prova convincente. Separa-los obrigaria a abrir tres expressoes.
 */
typedef struct
{
  /* --- Resumo --- */
  bms_fault_code_t code;        /**< falha mais severa ativa, em texto       */
  uint8_t          node;        /**< qual escravo da cadeia                  */
  uint8_t          cell;        /**< primeira celula afetada, 0xFF se n/a    */
  uint8_t          cell_count;  /**< quantas ao mesmo tempo                  */

  /* --- Mascaras apos histerese: e o que vale --- */
  uint16_t uv;                  /**< bit i = celula i em subtensao           */
  uint16_t ov;
  uint8_t  ut;                  /**< bit z = canal z frio demais (firmware)  */

  /* --- Cru do CI, latching --- */
  uint16_t gen_diag;
  uint16_t uv_raw;
  uint16_t ov_raw;

  /* --- Limiares em vigor --- */
  uint16_t uv_thr_mv;
  uint16_t ov_thr_mv;
  uint16_t hyst_mv;
  uint32_t ut_thr_ohm;
  uint8_t  ut_enabled;          /**< 0 = protecao de frio desligada          */

  /* --- Historico --- */
  uint16_t latched;             /**< acumula desde o ultimo clear            */
  uint32_t count;               /**< ciclos com alguma falha                 */
  uint8_t  read_status;
} bms_fault_t;

