guilettmann/bms_tle9012/firmware/bms_tle9012/Core/Src/main.c
/** Valores iniciais dos campos que nao comecam em zero. */
#define BMS_FAULT_INIT { .node       = BMS_NODE_ID,     \
                         .cell       = 0xFFu,           \
                         .uv_thr_mv  = BMS_UV_THR_MV,   \
                         .ov_thr_mv  = BMS_OV_THR_MV,   \
                         .hyst_mv    = BMS_FAULT_HYST_MV, \
                         .ut_thr_ohm = BMS_UT_THR_OHM,  \
                         .ut_enabled = 0u }

/** Injecao de falha para demonstracao. */
typedef struct
{
  bms_sim_fault_t request;      /**< o que se quer injetar                   */
  bms_sim_fault_t active;       /**< o que esta injetado                     */
  uint8_t         apply_status;
} bms_sim_t;

/* Estado do BMS, agrupado em quatro structs.
 *
 * volatile e global de proposito: e assim que o Live Expressions le com o
 * alvo rodando. Agrupar em struct significa uma expressao por assunto no
 * depurador, em vez de vinte variaveis soltas -- e a expansao mostra tudo
 * junto, o que importa quando alguem esta olhando por cima do ombro.
 *
 *   link   estado da cadeia e do smoke test
 *   meas   tensoes de celula
 *   temp   temperaturas
 *   fault  falhas, limiares em vigor e historico
 *   sim    injecao de falha para demonstracao
 */
volatile bms_link_t  link;
volatile bms_meas_t  meas;
volatile bms_temp_t  temp;
volatile bms_fault_t fault = BMS_FAULT_INIT;
volatile bms_sim_t   sim;

static uint32_t s_last_good_tick;
static uint8_t  s_consec_fail;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/**
 * @brief  Sobe a cadeia: atribui NODE_ID e configura as celulas ativas.
 * @return true se ambos os passos responderam com CRC valido.
 */
/**
 * @brief Menor teste possivel que prova o link inteiro.
 *
 * Atribui o NODE_ID e le o CONFIG de volta. Uma transacao de escrita e uma de
 * leitura, com valor esperado conhecido: se fecha, entao baudrate, MSB first,
 * CRC8, CRC3, eco e DMA estao todos corretos. Testar isto antes de tentar
 * medir tensao evita confundir erro de link com erro de medicao.
 */
static bool bms_smoke_test(void)
{
  link.smoke_attempts++;
  link.smoke_ok = 0u;

  /* Devolve o IC a NODE_ID = 0 antes de tentar atribuir. Sem isto, um IC que
   * manteve o ID de uma sessao anterior nunca mais e alcancado: a atribuicao
   * escreve no no 0, onde nao ha ninguem. E o que impedia o sistema de voltar
   * sozinho depois de desligar e religar. Inofensivo quando o IC ja esta em 0. */
  tle9012_force_reset(BMS_NODE_ID);

  /* Unico IC na cadeia, portanto ele e tambem o final node. Sem o bit FN
   * o broadcast nunca responde e tudo da timeout. */
  tle9012_status_t st = tle9012_assign_node_id(BMS_NODE_ID, true);

  if (st != TLE9012_OK)
  {
    link.smoke_status = (uint8_t)st;
    return false;
  }

  uint16_t config = 0u;
  st = tle9012_read_reg(BMS_NODE_ID, TLE9012_REG_CONFIG, &config);

  link.smoke_status = (uint8_t)st;
  link.smoke_config = config;

  if (st != TLE9012_OK)
  {
    return false;
  }

  /* Le o diagnostico geral. Nao bloqueia a inicializacao -- serve para
   * distinguir falha latcheada no dispositivo de problema de link. */
  {
    uint16_t diag = 0u;
    link.diag_status = (uint8_t)tle9012_read_reg(BMS_NODE_ID,
                                                TLE9012_REG_GEN_DIAG, &diag);
    if (link.diag_status == (uint8_t)TLE9012_OK)
    {
      fault.gen_diag = diag;

      /* O manual (secao 3.6.2) exige limpar manualmente o PS_ERR_SLEEP, que
       * pode ficar setado apos o reset de registradores por sleep. */
      if (diag != 0u)
      {
        (void)tle9012_write_reg(BMS_NODE_ID, TLE9012_REG_GEN_DIAG, 0x0000u);
      }
    }
  }

  /* O NODE_ID atribuido deve aparecer nos bits baixos do CONFIG. */
  if ((config & 0x3Fu) != BMS_NODE_ID)
  {
    return false;
  }

  link.smoke_ok = 1u;
  return true;
}

/**
 * @brief Sobe a cadeia: smoke test, desativa open load e configura as celulas.
 */
static bool bms_chain_init(void)
{
  if (!bms_smoke_test())
  {
    return false;
  }

  /* Recarrega o watchdog logo apos atribuir o NODE_ID: o manual avisa que a
   * propria inicializacao pode demorar mais que o intervalo do watchdog, e
   * nesse caso o ID recem-atribuido seria perdido. */
  if (tle9012_kick_watchdog(BMS_NODE_ID) != TLE9012_OK)
  {
    return false;
  }

  /* Limiares de tensao e de open load moram nos mesmos dois registradores,
   * entao sao escritos juntos. Open load em zero desativa o diagnostico, que
   * e obrigatorio com o ladder resistivo. */
  if (tle9012_set_thresholds(BMS_NODE_ID, BMS_UV_THR_MV, BMS_OV_THR_MV,
                             BMS_OL_MIN_MV, BMS_OL_MAX_MV) != TLE9012_OK)
  {
    return false;
  }

  if (tle9012_set_cell_count(BMS_NODE_ID, BMS_NUM_CELLS) != TLE9012_OK)
  {
    return false;
  }

  /* Rajada de multiread com as 12 celulas. Broadcast e exigido pelo manual
   * para este registrador (secao 4.37). */
  if (tle9012_multiread_configure(TLE9012_MULTIREAD_CFG_ALL_CELLS) != TLE9012_OK)
  {
    return false;
  }

  if (tle9012_config_temp(BMS_NODE_ID, BMS_NUM_TEMP,
                          BMS_TEMP_INTC, BMS_TEMP_OT_THR) != TLE9012_OK)
  {
    return false;
  }

  /* Amarra o round robin ao kick do watchdog, que ja roda a cada ciclo. */
  if (tle9012_sync_round_robin(BMS_NODE_ID) != TLE9012_OK)
  {
    return false;
  }

  /* Confirma lendo de volta -- o manual recomenda validar toda escrita de
   * configuracao relendo o registrador (secao 3.1.2). */
  uint16_t readback = 0u;

  if (tle9012_read_reg(BMS_NODE_ID, TLE9012_REG_PART_CONFIG, &readback) != TLE9012_OK)
  {
    return false;
  }

  return (readback == (uint16_t)((1u << BMS_NUM_CELLS) - 1u));
}

/** Um ciclo de medicao: dispara, espera a conversao e le as 12 celulas. */
static void bms_measure_cycle(void)
{
  uint16_t mv[BMS_NUM_CELLS];

  /* Realimenta o watchdog ANTES de medir. Se ele zerar, o TLE9012 dorme e o
   * NODE_ID volta a 0 -- a comunicacao cai sem nenhum sintoma alem de
   * timeouts, que e facil confundir com problema de fiacao. */
  tle9012_status_t st = tle9012_kick_watchdog(BMS_NODE_ID);

  if (st == TLE9012_OK)
  {
    st = tle9012_start_measurement(BMS_NODE_ID);
  }

