guilettmann/bms_tle9012/firmware/bms_tle9012/Core/Src/main.c
  /* Espera o hardware limpar PCVM_START, em vez de um atraso fixo chutado:
   * a leitura sai assim que fica pronta, e uma conversao que nao conclui
   * vira erro explicito em vez de dado lido cedo demais. */
  if (st == TLE9012_OK)
  {
    st = tle9012_wait_measurement(BMS_NODE_ID, BMS_CONV_MAX_POLLS);
  }

  /* Multiread: uma transacao de 64 bytes no lugar de doze de 9. */
  if (st == TLE9012_OK)
  {
    st = tle9012_multiread_cells_mv(BMS_NODE_ID, mv, BMS_NUM_CELLS);
  }

  meas.status = (uint8_t)st;

  if (st != TLE9012_OK)
  {
    meas.fail_count++;
    meas.valid = 0u;   /* meas.cell_mv passa a ser historico, nao medicao */

    if (s_consec_fail < 0xFFu)
    {
      s_consec_fail++;
    }

    /* Link caido: volta ao smoke test em vez de insistir para sempre num
     * canal morto. Cobre o caso de a CSC perder alimentacao ou o watchdog
     * do TLE9012 resetar o NODE_ID. */
    if (s_consec_fail >= BMS_MAX_CONSEC_FAIL)
    {
      link.ready = 0u;
    }

    return;
  }

  s_consec_fail = 0u;

  uint16_t vmin = 0xFFFFu;
  uint16_t vmax = 0u;

  for (uint8_t i = 0u; i < BMS_NUM_CELLS; i++)
  {
    meas.cell_mv[i] = mv[i];

    if (mv[i] < vmin) { vmin = mv[i]; }
    if (mv[i] > vmax) { vmax = mv[i]; }
  }

  meas.min_mv   = vmin;
  meas.max_mv   = vmax;
  meas.delta_mv = (uint16_t)(vmax - vmin);

  s_last_good_tick = HAL_GetTick();
  meas.age_ms = 0u;
  meas.valid  = 1u;
  meas.count++;
}

/** Indice do bit menos significativo setado, ou 0xFF se a mascara for zero. */
static uint8_t first_bit(uint16_t mask)
{
  for (uint8_t i = 0u; i < 16u; i++)
  {
    if ((mask & (uint16_t)(1u << i)) != 0u)
    {
      return i;
    }
  }

  return 0xFFu;
}

/** Quantos bits setados -- quantas celulas em falha ao mesmo tempo. */
static uint8_t count_bits(uint16_t mask)
{
  uint8_t n = 0u;

  while (mask != 0u)
  {
    mask &= (uint16_t)(mask - 1u);   /* limpa o bit menos significativo */
    n++;
  }

  return n;
}

/**
 * @brief Resolve a falha ativa mais severa em codigo simbolico.
 *
 * Ordem de prioridade, nao de ocorrencia: retorna a mais grave que estiver
 * ativa neste instante.
 */
static void bms_resolve_fault_code(void)
{
  const uint16_t d = fault.gen_diag;

  fault.cell       = 0xFFu;
  fault.cell_count = 0u;

  if (link.ready == 0u)          { fault.code = BMS_FAULT_CHAIN_DOWN;  return; }
  if (meas.valid == 0u)      { fault.code = BMS_FAULT_DATA_STALE;  return; }

  if (fault.ov != 0u)
  {
    fault.cell       = first_bit(fault.ov);
    fault.cell_count = count_bits(fault.ov);
    fault.code       = BMS_FAULT_CELL_OV;
    return;
  }

  if (fault.uv != 0u)
  {
    fault.cell       = first_bit(fault.uv);
    fault.cell_count = count_bits(fault.uv);
    fault.code       = BMS_FAULT_CELL_UV;
    return;
  }

  if ((d & TLE9012_DIAG_EXT_T_ERR) != 0u) { fault.code = BMS_FAULT_EXT_OVERTEMP; return; }
  if ((d & TLE9012_DIAG_INT_OT) != 0u)    { fault.code = BMS_FAULT_INT_OVERTEMP; return; }

  if (fault.ut != 0u)
  {
    fault.cell       = first_bit((uint16_t)fault.ut);
    fault.cell_count = count_bits((uint16_t)fault.ut);
    fault.code       = BMS_FAULT_UNDERTEMP;
    return;
  }

  if ((d & TLE9012_DIAG_OL_ERR) != 0u)      { fault.code = BMS_FAULT_OPEN_LOAD;   return; }
  if ((d & TLE9012_DIAG_ADC_ERR) != 0u)     { fault.code = BMS_FAULT_ADC;         return; }
  if ((d & TLE9012_DIAG_INT_IC_ERR) != 0u)  { fault.code = BMS_FAULT_INTERNAL_IC; return; }
  if ((d & TLE9012_DIAG_REG_CRC_ERR) != 0u) { fault.code = BMS_FAULT_REG_CRC;     return; }
  if ((d & TLE9012_DIAG_PS_ERR_SLEEP) != 0u){ fault.code = BMS_FAULT_PS_SLEEP;    return; }

  if ((d & (TLE9012_DIAG_BAL_ERR_UC | TLE9012_DIAG_BAL_ERR_OC)) != 0u)
  {
    fault.code = BMS_FAULT_BALANCING;
    return;
  }

  fault.code = BMS_FAULT_NONE;
}

/**
 * @brief Ha alguma condicao de falha ativa?
 *
 * Cobre tanto falha reportada pelo CI quanto perda de comunicacao e dado
 * obsoleto -- nao saber a tensao e, para um AMS, tao grave quanto saber que
 * ela esta errada.
 */
static bool bms_any_fault(void)
{
  if (link.ready == 0u)      { return true; }  /* cadeia caida             */
  if (meas.valid == 0u)  { return true; }  /* medicao obsoleta         */
  /* Usa a versao com histerese: e ela que define quando a falha realmente
   * sai, nao o flag cru do CI. */
  if (fault.uv != 0u)     { return true; }
  if (fault.ov != 0u)     { return true; }
  if (fault.ut != 0u)         { return true; }  /* subtemperatura, firmware */

  return ((fault.gen_diag & TLE9012_DIAG_FAULT_MASK) != 0u);
}

/**
 * @brief Aplica (ou remove) uma injecao de falha.
 *
 * Cada modo cria uma condicao fisica ou de configuracao que o TLE9012 detecta
 * pelo caminho normal. Nada aqui escreve em flag de diagnostico.
 */
static void bms_apply_simulation(bms_sim_fault_t which)
{
  tle9012_status_t st = TLE9012_OK;

  switch (which)
  {
    case BMS_SIM_UNDERVOLTAGE:
      /* Limiar de UV acima da tensao medida: as celulas passam a estar
       * legitimamente abaixo do limite configurado. */
      fault.uv_thr_mv = (uint16_t)(meas.max_mv + BMS_SIM_MARGIN_MV);
      fault.ov_thr_mv = BMS_OV_THR_MV;

      st = tle9012_set_thresholds(BMS_NODE_ID, fault.uv_thr_mv, fault.ov_thr_mv,
                                  BMS_OL_MIN_MV, BMS_OL_MAX_MV);
      break;

    case BMS_SIM_OVERVOLTAGE:
      /* Limiar de OV abaixo da tensao medida. Guarda contra underflow. */
      if (meas.min_mv > (BMS_SIM_MARGIN_MV + BMS_UV_THR_MV))
      {
        fault.uv_thr_mv = BMS_UV_THR_MV;
        fault.ov_thr_mv = (uint16_t)(meas.min_mv - BMS_SIM_MARGIN_MV);

        st = tle9012_set_thresholds(BMS_NODE_ID, fault.uv_thr_mv, fault.ov_thr_mv,
                                    BMS_OL_MIN_MV, BMS_OL_MAX_MV);
      }
      else
      {
        st = TLE9012_ERR_PARAM;   /* tensao baixa demais para injetar OV */
      }
      break;

    case BMS_SIM_OVERTEMP:
      /* OT dispara quando o resultado fica ABAIXO do limiar, porque a
       * resistencia do NTC cai com o calor. Limiar no maximo faz qualquer
       * leitura disparar. */
      st = tle9012_config_temp(BMS_NODE_ID, BMS_NUM_TEMP, BMS_TEMP_INTC,
                               TLE9012_TEMP_CONF_OT_MASK);
      break;

    case BMS_SIM_OPEN_LOAD:
      /* Reabilita o diagnostico de open load. Com o ladder resistivo ele
       * dispara de verdade, porque a resistencia do divisor e muito maior
       * que a interna de uma celula -- exatamente o que o manual descreve. */
      st = tle9012_set_thresholds(BMS_NODE_ID, BMS_UV_THR_MV, BMS_OV_THR_MV,
                                  60u, 220u);
      break;

    case BMS_SIM_UNDERTEMP:
      /* Limiar de UT abaixo da resistencia medida: o NTC passa a estar
       * legitimamente "mais frio" que o limite configurado. A comparacao e
       * a mesma da protecao real -- so o limiar mudou.
       *
       * Nota honesta: diferente dos outros modos, este exercita apenas a
       * deteccao em FIRMWARE, porque o TLE9012 nao tem protecao de
       * subtemperatura. Nao ha caminho de hardware para demonstrar aqui. */
      if ((temp.valid[0] != 0u) && (temp.ohms[0] > 100u))
      {
        fault.ut_enabled = 1u;
        fault.ut_thr_ohm = temp.ohms[0] / 2u;
      }
      else
      {
        /* Sem termistor conectado nao ha o que injetar: o canal esta
         * invalido e a protecao nao tem entrada. */
        st = TLE9012_ERR_PARAM;
      }
      break;

    case BMS_SIM_COMM_LOSS:
      /* Manda o CI dormir. A comunicacao cai de fato, o NODE_ID reseta, e a
       * recuperacao automatica e exercitada junto. */
      st = tle9012_write_reg(BMS_NODE_ID, TLE9012_REG_OP_MODE, 0xC401u);
      break;

    case BMS_SIM_NONE:
    default:
      /* Restaura a configuracao normal. */
      fault.uv_thr_mv = BMS_UV_THR_MV;
      fault.ov_thr_mv = BMS_OV_THR_MV;

      st = tle9012_set_thresholds(BMS_NODE_ID, fault.uv_thr_mv, fault.ov_thr_mv,
                                  BMS_OL_MIN_MV, BMS_OL_MAX_MV);
      if (st == TLE9012_OK)
      {
        st = tle9012_config_temp(BMS_NODE_ID, BMS_NUM_TEMP,
                                 BMS_TEMP_INTC, BMS_TEMP_OT_THR);
      }
      if (st == TLE9012_OK)
      {
        st = tle9012_clear_faults(BMS_NODE_ID);
        fault.latched = 0u;
      }
      fault.ut_thr_ohm   = BMS_UT_THR_OHM;   /* desfaz injecao de subtemperatura */
      fault.ut_enabled   = 0u;               /* volta desligada: sem termistor   */
      fault.ut     = 0u;
      fault.uv = 0u;               /* sai do estado latcheado          */
      fault.ov = 0u;
      break;
  }

  sim.apply_status = (uint8_t)st;
  sim.active       = which;
}

/** Botao azul da Nucleo: avanca para o proximo modo de simulacao. */
void BSP_PB_Callback(Button_TypeDef Button)
{
  if (Button == BUTTON_USER)
  {
    sim.request = (bms_sim_fault_t)(((uint8_t)sim.request + 1u)
                                    % (uint8_t)BMS_SIM_COUNT);
  }
}

/**
 * @brief Le o estado de falha do dispositivo.
 *
 * Nao limpa nada: limpar falha e decisao de quem trata, nao de quem le. O
 * acumulador fault.latched existe porque uma falha momentanea pode sumir do
 * GEN_DIAG antes de alguem olhar -- perder isso num BMS e inaceitavel.
 */
static void bms_fault_cycle(void)
{
  tle9012_faults_t f;

  const tle9012_status_t st = tle9012_read_faults(BMS_NODE_ID, &f);
  fault.read_status = (uint8_t)st;

  if (st != TLE9012_OK)
  {
    return;
  }

