guilettmann/bms_tle9012/firmware/bms_tle9012/Core/Src/main.c
  fault.gen_diag = f.gen_diag;
  fault.uv_raw   = f.cell_uv;
  fault.ov_raw   = f.cell_ov;

  /* Seta imediatamente: deteccao nunca e atrasada pela histerese. */
  fault.uv |= f.cell_uv;
  fault.ov |= f.cell_ov;

  /* Limpa so com margem, e so com medicao valida. Dado obsoleto nunca pode
   * justificar sair de um estado de falha. */
  if (meas.valid != 0u)
  {
    uint16_t clear_uv = 0u;
    uint16_t clear_ov = 0u;

    for (uint8_t i = 0u; i < BMS_NUM_CELLS; i++)
    {
      const uint16_t bit = (uint16_t)(1u << i);
      const uint16_t mv  = meas.cell_mv[i];

      if (((fault.uv & bit) != 0u) &&
          (mv > (uint16_t)(fault.uv_thr_mv + BMS_FAULT_HYST_MV)))
      {
        clear_uv |= bit;
      }

      if (((fault.ov & bit) != 0u) &&
          (fault.ov_thr_mv > BMS_FAULT_HYST_MV) &&
          (mv < (uint16_t)(fault.ov_thr_mv - BMS_FAULT_HYST_MV)))
      {
        clear_ov |= bit;
      }
    }

    if ((clear_uv != 0u) || (clear_ov != 0u))
    {
      /* Limpa tambem no CI: o flag e latching, entao sem isto ele
       * reapareceria na proxima leitura e a histerese nao teria efeito. */
      if (tle9012_clear_cell_flags(BMS_NODE_ID, clear_uv, clear_ov)
          == TLE9012_OK)
      {
        fault.uv &= (uint16_t)~clear_uv;
        fault.ov &= (uint16_t)~clear_ov;
      }
    }

    /* CELL_UV e CELL_OV do GEN_DIAG sao bits-RESUMO, em registrador
     * separado dos flags por celula. Limpar os detalhados nao limpa o
     * resumo -- sem isto o GEN_DIAG fica preso na falha antiga.
     *
     * Sao do tipo rocwl: escrever '0' limpa o bit e reseta o registrador
     * detalhado associado, que a esta altura ja esta vazio. */
    uint16_t diag_clear = 0u;

    if ((fault.uv == 0u) && ((fault.gen_diag & TLE9012_DIAG_CELL_UV) != 0u))
    {
      diag_clear |= TLE9012_DIAG_CELL_UV;
    }

    if ((fault.ov == 0u) && ((fault.gen_diag & TLE9012_DIAG_CELL_OV) != 0u))
    {
      diag_clear |= TLE9012_DIAG_CELL_OV;
    }

    if (diag_clear != 0u)
    {
      /* '1' preserva os demais bits; '0' so nas posicoes a limpar. */
      (void)tle9012_write_reg(BMS_NODE_ID, TLE9012_REG_GEN_DIAG,
                              (uint16_t)~diag_clear);
    }
  }

  /* Bits 0 a 4 do GEN_DIAG sao status de operacao, nao erro -- nao entram
   * no acumulador para nao poluir com "round robin ativo" e afins. */
  fault.latched |= (uint16_t)(f.gen_diag & TLE9012_DIAG_FAULT_MASK);

  if (((f.gen_diag & TLE9012_DIAG_FAULT_MASK) != 0u) ||
      (f.cell_uv != 0u) || (f.cell_ov != 0u))
  {
    fault.count++;
  }
}

/**
 * @brief Le os NTCs externos e converte para resistencia.
 *
 * Nao afeta link.ready: falha de temperatura nao derruba a cadeia, so
 * invalida os canais. A tensao continua sendo o dado critico.
 */
static void bms_temp_cycle(void)
{
  tle9012_temp_raw_t raw[BMS_NUM_TEMP];

  const tle9012_status_t st = tle9012_read_temp_raw(BMS_NODE_ID, raw,
                                                    BMS_NUM_TEMP);
  temp.status = (uint8_t)st;

  if (st != TLE9012_OK)
  {
    temp.fail_count++;

    for (uint8_t z = 0u; z < BMS_NUM_TEMP; z++)
    {
      temp.valid[z] = 0u;
    }

    return;
  }

  for (uint8_t z = 0u; z < BMS_NUM_TEMP; z++)
  {
    /* O bit VALID e limpo ao ler: se estiver zero, o round robin ainda nao
     * produziu resultado novo para este canal desde a leitura anterior. */
    if (!raw[z].valid)
    {
      temp.valid[z] = 0u;
      continue;
    }

    const uint32_t measured = tle9012_temp_raw_to_ohms(&raw[z],
                                                       BMS_TEMP_R_SERIES);

    /* O que o ADC ve: NTC externo em paralelo com o componente da placa. */
    temp.ohms_raw[z] = measured;

    /* Guarda de confiabilidade: perto de R_PARALLEL o denominador da
     * compensacao tende a zero e o resultado deixa de ter significado. */
    const uint32_t trust_limit =
        ((uint32_t)BMS_TEMP_R_PARALLEL * BMS_TEMP_TRUST_PCT) / 100uL;

    if (measured >= trust_limit)
    {
      /* Tipicamente: nenhum NTC externo conectado neste canal. */
      temp.valid[z] = 0u;
      fault.ut &= (uint8_t)~(1u << z);
      continue;
    }

    const uint32_t ohms = tle9012_compensate_parallel(measured,
                                                      BMS_TEMP_R_PARALLEL);

    if (ohms == 0u)
    {
      temp.valid[z] = 0u;
      fault.ut &= (uint8_t)~(1u << z);
      continue;
    }

    temp.ohms[z]  = ohms;
    temp.valid[z] = 1u;

    /* Subtemperatura em firmware: NTC tem coeficiente negativo, entao mais
     * frio = maior resistencia. */
    if ((fault.ut_enabled != 0u) && (ohms > fault.ut_thr_ohm))
    {
      fault.ut |= (uint8_t)(1u << z);
    }
    else
    {
      fault.ut &= (uint8_t)~(1u << z);
    }

    /* Equacao de Beta, so para leitura humana. Protecao deve comparar em
     * ohms, sem passar por logaritmo. */
    if (ohms > 0u)
    {
      const float t_kelvin =
          1.0f / ((1.0f / 298.15f)
                  + (logf((float)ohms / BMS_NTC_R25_OHM) / BMS_NTC_BETA));

      temp.celsius[z] = t_kelvin - 273.15f;
    }
  }

  temp.count++;
}

/**
 * @brief Rearma a recepcao apos erro de linha.
 * @note  Sem isto, um unico overrun derruba o DMA circular em definitivo.
 */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  if (huart->Instance == USART1)
  {
    tle9012_port_recover();
  }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */
  tle9012_port_init(&huart1);
  tle9012_bind(tle9012_port_transport());

  /* O TLE9015 liga acordado (nSleep tem pull-up interno e so manda dormir na
   * borda de descida), portanto aqui apenas fixamos o nivel. Ja o TLE9012
   * precisa mesmo ser acordado, e isso se faz com um comando de leitura.
   * Se o nSleep nao estiver fiado, a primeira chamada pode ser removida. */
  tle9012_port_inhibit_sleep();
  tle9012_wakeup();

